# Exploration du fichier NYPD_Complaint_Data_Historic

Ce notebook permet d'explorer les donn√©es des fichiers Complaints_2024.

In [1]:
import pandas as pd

df = pd.read_csv('../data/raw/Complaints_2024.csv', low_memory=False)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 563430 entries, 0 to 563429
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   CMPLNT_NUM    563430 non-null  object
 1   CMPLNT_FR_DT  563430 non-null  object
 2   BORO_NM       563430 non-null  object
 3   Latitude      563417 non-null  float64
 4   Longitude     563417 non-null  float64
dtypes: float64(2), object(3)
memory usage: 21.5+ MB

In [2]:
df.head()

  CMPLNT_NUM CMPLNT_FR_DT    BORO_NM   Latitude  Longitude
0  298687052   12/31/2024   BROOKLYN  40.674496 -73.930571
1  298687022   12/23/2024   BROOKLYN  40.578188 -73.952143
2  298776127   12/31/2024  MANHATTAN  40.720893 -73.988819
3  298683987   12/31/2024   BROOKLYN  40.674496 -73.930571
4  298688613   12/31/2024  MANHATTAN  40.712368 -74.008885

In [3]:
# Removing data without lat/long
df.dropna(subset=['Latitude', 'Longitude'], inplace=True)

In [12]:
df = df[df['BORO_NM'] != '(null)']

In [17]:
# adding Borough code for cat
df['BORO_CODE'] = df['BORO_NM'].map({
    'MANHATTAN': 1,
    'BRONX': 2,
    'BROOKLYN': 3,
    'QUEENS': 4,
    'STATEN ISLAND': 5
})

df.to_csv('../data/processed/Complaints_2024.csv')